app/controllers/info_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT `orders`.* FROM `orders` INNER JOIN `line_items` ON `orders`.id = `line_items`.order_id WHERE ((`line_items`.product_id = 3)) LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])
    @orders = @product.orders