app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
    product = Product.find(params[:id])

INSERT INTO `line_items` (`product_id`, `quantity`, `order_id`, `total_price`) VALUES(1, 1, 1, 29.95)
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('Mohamed Magdy', '10 Nasser St.', '2011-12-01 09:15:24', '2011-12-01 09:15:24', 'check', 'mohamagdy@yahoo.com')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save