app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('Mohamed Magdy', '-6131590780.791174230727185', '2011-12-01 10:27:20', '2011-12-01 10:27:20', '2bf68b970d5fde2300df4aae1a7416548cfd79ac')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy